app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = ?, "password_digest" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "afizz@gmaill.com"], ["password_digest", "$2a$10$UJF4YbUm./AQuY63T44gSeNtUPTAEImpsrPS9QtmmgXIJXJRgipgu"], ["username", "afizz"], ["updated_at", 2017-01-28 23:45:44 UTC], ["id", 2]]
---
  def update

    if @user.update(user_params)